pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6037.h
/* GCCTL1 Control Bits */
#define WPIFG                            (0x0010)        /* Write Protection Detection flag */
#define WPIFG_L                          (0x0010)
#define WPIFG_0                          (0x0000)        /* No interrupt pending. */
#define WPIFG_1                          (0x0010)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV when it is the highest pending interrupt. */
#define WPIFG_1_L                        (0x0010)
#define ACCTEIFG                         (0x0008)        /* Access time error flag */
#define ACCTEIFG_L                       (0x0008)
#define ACCTEIFG_0                       (0x0000)        /* No interrupt pending. */
#define ACCTEIFG_1                       (0x0008)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV when it is the highest pending interrupt. */
#define ACCTEIFG_1_L                     (0x0008)
#define UBDIFG                           (0x0004)        /* FRAM uncorrectable bit error detection flag */
#define UBDIFG_L                         (0x0004)
#define UBDIFG_0                         (0x0000)        /* No interrupt pending. */
#define UBDIFG_1                         (0x0004)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV when it is the highest pending interrupt. */
#define UBDIFG_1_L                       (0x0004)
#define CBDIFG                           (0x0002)        /* FRAM correctable bit error detection flag */
#define CBDIFG_L                         (0x0002)
#define CBDIFG_0                         (0x0000)        /* No interrupt is pending */
#define CBDIFG_1                         (0x0002)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV if it is the highest pending interrupt. */
#define CBDIFG_1_L                       (0x0002)


/*****************************************************************************
 LCD_C Registers
*****************************************************************************/

#define __MSP430_HAS_LCD_C__                  /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_LCD_C__ 0x0A00
#define LCD_C_BASE             __MSP430_BASEADDRESS_LCD_C__

sfr_w(LCDCCTL0);                              /* LCD_C control 0 */
sfr_b(LCDCCTL0_L);
sfr_b(LCDCCTL0_H);
sfr_w(LCDCCTL1);                              /* LCD_C control 1 */
sfr_b(LCDCCTL1_L);
sfr_b(LCDCCTL1_H);
sfr_w(LCDCBLKCTL);                            /* LCD_C blinking control */
sfr_b(LCDCBLKCTL_L);
sfr_b(LCDCBLKCTL_H);
sfr_w(LCDCMEMCTL);                            /* LCD_C memory control */
sfr_b(LCDCMEMCTL_L);
sfr_b(LCDCMEMCTL_H);
sfr_w(LCDCVCTL);                              /* LCD_C Voltage Control Register */
sfr_b(LCDCVCTL_L);
sfr_b(LCDCVCTL_H);
sfr_w(LCDCPCTL0);                             /* LCD_C port control 0 */
sfr_b(LCDCPCTL0_L);
sfr_b(LCDCPCTL0_H);
sfr_w(LCDCPCTL1);                             /* LCD_C port control 1 */
sfr_b(LCDCPCTL1_L);
sfr_b(LCDCPCTL1_H);
sfr_w(LCDCPCTL2);                             /* LCD_C port control 2 (256 segments) */
sfr_b(LCDCPCTL2_L);
sfr_b(LCDCPCTL2_H);
sfr_w(LCDCPCTL3);                             /* LCD_C port control 3 (384 segments) */
sfr_b(LCDCPCTL3_L);
sfr_b(LCDCPCTL3_H);
sfr_w(LCDCCPCTL);                             /* LCD_C charge pump control */
sfr_b(LCDCCPCTL_L);
sfr_b(LCDCCPCTL_H);
sfr_w(LCDCIV);                                /* LCD_C interrupt vector */
sfr_b(LCDCIV_L);
sfr_b(LCDCIV_H);
sfr_b(LCDM1);                                 /* LCD memory 1 */

sfr_b(LCDM2);                                 /* LCD memory 2 */

sfr_b(LCDM3);                                 /* LCD memory 3 */

sfr_b(LCDM4);                                 /* LCD memory 4 */

sfr_b(LCDM5);                                 /* LCD memory 5 */

sfr_b(LCDM6);                                 /* LCD memory 6 */

sfr_b(LCDM7);                                 /* LCD memory 7 */

sfr_b(LCDM8);                                 /* LCD memory 8 */

sfr_b(LCDM9);                                 /* LCD memory 9 */

sfr_b(LCDM10);                                /* LCD memory 10 */

sfr_b(LCDM11);                                /* LCD memory 11 */

sfr_b(LCDM12);                                /* LCD memory 12 */

sfr_b(LCDM13);                                /* LCD memory 13 */

sfr_b(LCDM14);                                /* LCD memory 14 */

sfr_b(LCDM15);                                /* LCD memory 15 */

sfr_b(LCDM16);                                /* LCD memory 16 */

sfr_b(LCDM17);                                /* LCD memory 17 */

sfr_b(LCDM18);                                /* LCD memory 18 */

sfr_b(LCDM19);                                /* LCD memory 19 */

sfr_b(LCDM20);                                /* LCD memory 20 */

sfr_b(LCDM21);                                /* LCD memory 21 */

sfr_b(LCDM22);                                /* LCD memory 22 */

sfr_b(LCDM23);                                /* LCD memory 23 */

sfr_b(LCDM24);                                /* LCD memory 24 */

sfr_b(LCDM25);                                /* LCD memory 25 */

sfr_b(LCDM26);                                /* LCD memory 26 */

sfr_b(LCDM27);                                /* LCD memory 27 */

sfr_b(LCDM28);                                /* LCD memory 28 */

sfr_b(LCDM29);                                /* LCD memory 29 */

sfr_b(LCDM30);                                /* LCD memory 30 */

sfr_b(LCDM31);                                /* LCD memory 31 */

sfr_b(LCDM32);                                /* LCD memory 32 */

sfr_b(LCDM33_LCDBM1);                         /* LCD memory 33 / LCD blinking memory 1 */

sfr_b(LCDM34_LCDBM2);                         /* LCD memory 34 / LCD blinking memory 2 */

sfr_b(LCDM35_LCDBM3);                         /* LCD memory 35 / LCD blinking memory 3 */

sfr_b(LCDM36_LCDBM4);                         /* LCD memory 36 / LCD blinking memory 4 */

