pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6037.h
/* LCDCPCTL1 Control Bits */
#define LCDS16                           (0x0001)        /* LCD segment line 16 enable */
#define LCDS16_L                         (0x0001)
#define LCDS16_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS16_1                         (0x0001)        /* Pins are LCD functions */
#define LCDS16_1_L                       (0x0001)
#define LCDS17                           (0x0002)        /* LCD segment line 17 enable */
#define LCDS17_L                         (0x0002)
#define LCDS17_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS17_1                         (0x0002)        /* Pins are LCD functions */
#define LCDS17_1_L                       (0x0002)
#define LCDS18                           (0x0004)        /* LCD segment line 18 enable */
#define LCDS18_L                         (0x0004)
#define LCDS18_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS18_1                         (0x0004)        /* Pins are LCD functions */
#define LCDS18_1_L                       (0x0004)
#define LCDS19                           (0x0008)        /* LCD segment line 19 enable */
#define LCDS19_L                         (0x0008)
#define LCDS19_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS19_1                         (0x0008)        /* Pins are LCD functions */
#define LCDS19_1_L                       (0x0008)
#define LCDS20                           (0x0010)        /* LCD segment line 20 enable */
#define LCDS20_L                         (0x0010)
#define LCDS20_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS20_1                         (0x0010)        /* Pins are LCD functions */
#define LCDS20_1_L                       (0x0010)
#define LCDS21                           (0x0020)        /* LCD segment line 21 enable */
#define LCDS21_L                         (0x0020)
#define LCDS21_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS21_1                         (0x0020)        /* Pins are LCD functions */
#define LCDS21_1_L                       (0x0020)
#define LCDS22                           (0x0040)        /* LCD segment line 22 enable */
#define LCDS22_L                         (0x0040)
#define LCDS22_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS22_1                         (0x0040)        /* Pins are LCD functions */
#define LCDS22_1_L                       (0x0040)
#define LCDS23                           (0x0080)        /* LCD segment line 23 enable */
#define LCDS23_L                         (0x0080)
#define LCDS23_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS23_1                         (0x0080)        /* Pins are LCD functions */
#define LCDS23_1_L                       (0x0080)
#define LCDS24                           (0x0100)        /* LCD segment line 24 enable */
#define LCDS24_H                         (0x0001)
#define LCDS24_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS24_1                         (0x0100)        /* Pins are LCD functions */
#define LCDS24_1_H                       (0x0001)
#define LCDS25                           (0x0200)        /* LCD segment line 25 enable */
#define LCDS25_H                         (0x0002)
#define LCDS25_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS25_1                         (0x0200)        /* Pins are LCD functions */
#define LCDS25_1_H                       (0x0002)
#define LCDS26                           (0x0400)        /* LCD segment line 26 enable */
#define LCDS26_H                         (0x0004)
#define LCDS26_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS26_1                         (0x0400)        /* Pins are LCD functions */
#define LCDS26_1_H                       (0x0004)
#define LCDS27                           (0x0800)        /* LCD segment line 27 enable */
#define LCDS27_H                         (0x0008)
#define LCDS27_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS27_1                         (0x0800)        /* Pins are LCD functions */
#define LCDS27_1_H                       (0x0008)
#define LCDS28                           (0x1000)        /* LCD segment line 28 enable */
#define LCDS28_H                         (0x0010)
#define LCDS28_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS28_1                         (0x1000)        /* Pins are LCD functions */
#define LCDS28_1_H                       (0x0010)
#define LCDS29                           (0x2000)        /* LCD segment line 29 enable */
#define LCDS29_H                         (0x0020)
#define LCDS29_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS29_1                         (0x2000)        /* Pins are LCD functions */
#define LCDS29_1_H                       (0x0020)
#define LCDS30                           (0x4000)        /* LCD segment line 30 enable */
#define LCDS30_H                         (0x0040)
#define LCDS30_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS30_1                         (0x4000)        /* Pins are LCD functions */
#define LCDS30_1_H                       (0x0040)
#define LCDS31                           (0x8000)        /* LCD segment line 31 enable */
#define LCDS31_H                         (0x0080)
#define LCDS31_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS31_1                         (0x8000)        /* Pins are LCD functions */
#define LCDS31_1_H                       (0x0080)

/* LCDCPCTL2 Control Bits */
#define LCDS32                           (0x0001)        /* LCD segment line 32 enable */
#define LCDS32_L                         (0x0001)
#define LCDS32_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS32_1                         (0x0001)        /* Pins are LCD functions */
#define LCDS32_1_L                       (0x0001)
#define LCDS33                           (0x0002)        /* LCD segment line 33 enable */
#define LCDS33_L                         (0x0002)
#define LCDS33_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS33_1                         (0x0002)        /* Pins are LCD functions */
#define LCDS33_1_L                       (0x0002)
#define LCDS34                           (0x0004)        /* LCD segment line 34 enable */
#define LCDS34_L                         (0x0004)
#define LCDS34_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS34_1                         (0x0004)        /* Pins are LCD functions */
#define LCDS34_1_L                       (0x0004)
#define LCDS35                           (0x0008)        /* LCD segment line 35 enable */
#define LCDS35_L                         (0x0008)
#define LCDS35_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS35_1                         (0x0008)        /* Pins are LCD functions */
#define LCDS35_1_L                       (0x0008)
#define LCDS36                           (0x0010)        /* LCD segment line 36 enable */
#define LCDS36_L                         (0x0010)
#define LCDS36_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS36_1                         (0x0010)        /* Pins are LCD functions */
#define LCDS36_1_L                       (0x0010)
#define LCDS37                           (0x0020)        /* LCD segment line 37 enable */
#define LCDS37_L                         (0x0020)
#define LCDS37_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS37_1                         (0x0020)        /* Pins are LCD functions */
#define LCDS37_1_L                       (0x0020)
#define LCDS38                           (0x0040)        /* LCD segment line 38 enable */
#define LCDS38_L                         (0x0040)
#define LCDS38_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS38_1                         (0x0040)        /* Pins are LCD functions */
#define LCDS38_1_L                       (0x0040)
#define LCDS39                           (0x0080)        /* LCD segment line 39 enable */
#define LCDS39_L                         (0x0080)
#define LCDS39_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS39_1                         (0x0080)        /* Pins are LCD functions */
#define LCDS39_1_L                       (0x0080)
#define LCDS40                           (0x0100)        /* LCD segment line 40 enable */
#define LCDS40_H                         (0x0001)
#define LCDS40_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS40_1                         (0x0100)        /* Pins are LCD functions */
#define LCDS40_1_H                       (0x0001)
#define LCDS41                           (0x0200)        /* LCD segment line 41 enable */
#define LCDS41_H                         (0x0002)
#define LCDS41_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS41_1                         (0x0200)        /* Pins are LCD functions */
#define LCDS41_1_H                       (0x0002)
#define LCDS42                           (0x0400)        /* LCD segment line 42 enable */
#define LCDS42_H                         (0x0004)
#define LCDS42_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS42_1                         (0x0400)        /* Pins are LCD functions */
#define LCDS42_1_H                       (0x0004)
#define LCDS43                           (0x0800)        /* LCD segment line 43 enable */
#define LCDS43_H                         (0x0008)
#define LCDS43_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS43_1                         (0x0800)        /* Pins are LCD functions */
#define LCDS43_1_H                       (0x0008)
#define LCDS44                           (0x1000)        /* LCD segment line 44 enable */
#define LCDS44_H                         (0x0010)
#define LCDS44_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS44_1                         (0x1000)        /* Pins are LCD functions */
#define LCDS44_1_H                       (0x0010)
#define LCDS45                           (0x2000)        /* LCD segment line 45 enable */
#define LCDS45_H                         (0x0020)
#define LCDS45_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS45_1                         (0x2000)        /* Pins are LCD functions */
#define LCDS45_1_H                       (0x0020)
#define LCDS46                           (0x4000)        /* LCD segment line 46 enable */
#define LCDS46_H                         (0x0040)
#define LCDS46_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS46_1                         (0x4000)        /* Pins are LCD functions */
#define LCDS46_1_H                       (0x0040)
#define LCDS47                           (0x8000)        /* LCD segment line 47 enable */
#define LCDS47_H                         (0x0080)
#define LCDS47_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS47_1                         (0x8000)        /* Pins are LCD functions */
#define LCDS47_1_H                       (0x0080)

/* LCDCPCTL3 Control Bits */
#define LCDS48                           (0x0001)        /* LCD segment line 48 enable */
#define LCDS48_L                         (0x0001)
#define LCDS48_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS48_1                         (0x0001)        /* Pins are LCD functions */
#define LCDS48_1_L                       (0x0001)
#define LCDS49                           (0x0002)        /* LCD segment line 49 enable */
#define LCDS49_L                         (0x0002)
#define LCDS49_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS49_1                         (0x0002)        /* Pins are LCD functions */
#define LCDS49_1_L                       (0x0002)
#define LCDS50                           (0x0004)        /* LCD segment line 50 enable */
#define LCDS50_L                         (0x0004)
#define LCDS50_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS50_1                         (0x0004)        /* Pins are LCD functions */
#define LCDS50_1_L                       (0x0004)
#define LCDS51                           (0x0008)        /* LCD segment line 51 enable */
#define LCDS51_L                         (0x0008)
#define LCDS51_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS51_1                         (0x0008)        /* Pins are LCD functions */
#define LCDS51_1_L                       (0x0008)
#define LCDS52                           (0x0010)        /* LCD segment line 52 enable */
#define LCDS52_L                         (0x0010)
#define LCDS52_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS52_1                         (0x0010)        /* Pins are LCD functions */
#define LCDS52_1_L                       (0x0010)
#define LCDS53                           (0x0020)        /* LCD segment line 53 enable */
#define LCDS53_L                         (0x0020)
#define LCDS53_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS53_1                         (0x0020)        /* Pins are LCD functions */
#define LCDS53_1_L                       (0x0020)

/* LCDCCPCTL Control Bits */
#define LCDCPDIS                         (0x00ff)        /* LCD charge pump disable */
#define LCDCPDIS_L                       (0x00ff)
#define LCDCPDIS0                        (0x0001)        /* LCD charge pump disable */
#define LCDCPDIS0_L                      (0x0001)
#define LCDCPDIS1                        (0x0002)        /* LCD charge pump disable */
#define LCDCPDIS1_L                      (0x0002)
#define LCDCPDIS2                        (0x0004)        /* LCD charge pump disable */
#define LCDCPDIS2_L                      (0x0004)
#define LCDCPDIS3                        (0x0008)        /* LCD charge pump disable */
#define LCDCPDIS3_L                      (0x0008)
#define LCDCPDIS4                        (0x0010)        /* LCD charge pump disable */
#define LCDCPDIS4_L                      (0x0010)
#define LCDCPDIS5                        (0x0020)        /* LCD charge pump disable */
#define LCDCPDIS5_L                      (0x0020)
#define LCDCPDIS6                        (0x0040)        /* LCD charge pump disable */
#define LCDCPDIS6_L                      (0x0040)
#define LCDCPDIS7                        (0x0080)        /* LCD charge pump disable */
#define LCDCPDIS7_L                      (0x0080)
#define LCDCPCLKSYNC                     (0x8000)        /* LCD charge pump clock synchronization */
#define LCDCPCLKSYNC_H                   (0x0080)
#define LCDCPCLKSYNC_0                   (0x0000)        /* Synchronization disabled */
#define LCDCPCLKSYNC_1                   (0x8000)        /* Synchronization enabled */
#define LCDCPCLKSYNC_1_H                 (0x0080)

